// Напишите программу, которая на вход принимает число и
// выдаёт его квадрат (число, умноженное на само себя).

// string num = Console.ReadLine()!;
int numm = int.Parse(Console.ReadLine()!);

Console.WriteLine(numm*numm);

